# Chapter 7

In [1]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

NameError: name 'pd' is not defined

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1,NA,3.5,NA,7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df

          0         1         2
0 -0.463178  0.621307 -0.483418
1 -1.758345 -2.352190  2.144798
2 -0.272315 -0.642240 -1.031698
3  0.014915  1.301329  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [26]:
df.iloc[:4,1] = NA

In [27]:
df

          0         1         2
0 -0.463178       NaN -0.483418
1 -1.758345       NaN  2.144798
2 -0.272315       NaN -1.031698
3  0.014915       NaN  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [28]:
df.iloc[:2,2] = NA

In [29]:
df

          0         1         2
0 -0.463178       NaN       NaN
1 -1.758345       NaN       NaN
2 -0.272315       NaN -1.031698
3  0.014915       NaN  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [30]:
df.dropna()

          0         1         2
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [31]:
df.dropna(thresh = 2)

          0         1         2
2 -0.272315       NaN -1.031698
3  0.014915       NaN  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [32]:
df.fillna(0)

          0         1         2
0 -0.463178  0.000000  0.000000
1 -1.758345  0.000000  0.000000
2 -0.272315  0.000000 -1.031698
3  0.014915  0.000000  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [33]:
df.fillna({1:0.5,2: 0})

          0         1         2
0 -0.463178  0.500000  0.000000
1 -1.758345  0.500000  0.000000
2 -0.272315  0.500000 -1.031698
3  0.014915  0.500000  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [34]:
_ = df.fillna(0, inplace = True)

In [35]:
df

          0         1         2
0 -0.463178  0.000000  0.000000
1 -1.758345  0.000000  0.000000
2 -0.272315  0.000000 -1.031698
3  0.014915  0.000000  1.728298
4 -0.965184  2.578525  0.011324
5 -0.765728 -0.633430 -0.191189
6 -1.011744 -2.185127  0.553430

In [36]:
df = pd.DataFrame(np.random.randn(6,3))

In [37]:
df

          0         1         2
0 -1.789382 -0.059425  0.821881
1  0.819446 -0.393598 -1.206652
2  0.739815 -2.035584  0.974715
3 -0.532707 -1.875330 -0.864459
4  1.278663  0.148811  0.655967
5 -0.079856  0.507960 -1.048965

In [40]:
df.iloc[2:,1] = NA

In [41]:
df

          0         1         2
0 -1.789382 -0.059425  0.821881
1  0.819446 -0.393598 -1.206652
2  0.739815       NaN  0.974715
3 -0.532707       NaN -0.864459
4  1.278663       NaN  0.655967
5 -0.079856       NaN -1.048965

In [42]:
df.iloc[4:,2] = NA

In [43]:
df

          0         1         2
0 -1.789382 -0.059425  0.821881
1  0.819446 -0.393598 -1.206652
2  0.739815       NaN  0.974715
3 -0.532707       NaN -0.864459
4  1.278663       NaN       NaN
5 -0.079856       NaN       NaN

In [44]:
df.fillna(method='ffill')

          0         1         2
0 -1.789382 -0.059425  0.821881
1  0.819446 -0.393598 -1.206652
2  0.739815 -0.393598  0.974715
3 -0.532707 -0.393598 -0.864459
4  1.278663 -0.393598 -0.864459
5 -0.079856 -0.393598 -0.864459

In [45]:
df.fillna(method = 'ffill',limit =2)

          0         1         2
0 -1.789382 -0.059425  0.821881
1  0.819446 -0.393598 -1.206652
2  0.739815 -0.393598  0.974715
3 -0.532707 -0.393598 -0.864459
4  1.278663       NaN -0.864459
5 -0.079856       NaN -0.864459

In [46]:
data = pd.Series([1.,NA,3.5,NA,7])

In [47]:
data.mean()

3.8333333333333335

In [48]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})

In [50]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [51]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [52]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [56]:
data['v1'] = range(7)
data['v1']

0    0
1    1
2    2
3    3
4    4
5    5
6    6
Name: v1, dtype: int64

In [54]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [57]:
data.drop_duplicates(['k1','k2'], keep ='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [58]:
data = pd.DataFrame({'food':['bacon','pulled pork','ibacon','Pastrami','Corned beef','Bacon','Pastrami','Honey ham','Nova Lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [59]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2       ibacon    12.0
3     Pastrami     6.0
4  Corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    Honey ham     5.0
8     Nova Lox     6.0

In [60]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'Nova Lox ': 'salmon'
}

In [61]:
lowercased = data['food'].str.lower()

In [62]:
lowercased

0          bacon
1    pulled pork
2         ibacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [63]:
data['animal'] = lowercased.map(meat_to_animal)

In [64]:
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2       ibacon    12.0    NaN
3     Pastrami     6.0    cow
4  Corned beef     7.5    cow
5        Bacon     8.0    pig
6     Pastrami     3.0    cow
7    Honey ham     5.0    pig
8     Nova Lox     6.0    NaN

In [65]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

KeyError: 'ibacon'

In [66]:
data = pd.Series([1.,-999,2.,-999.,-1000.,3.])

In [67]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [73]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [74]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one','two','three','four'])

In [75]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
transform = lambda x: x[:4].upper()

In [77]:
transform

In [78]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [79]:
data.index = data.index.map(transform)

In [80]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [81]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [82]:
data.rename(index = {'OHIO': 'INDIANA'},
           columns= {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [83]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [84]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [85]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [86]:
bins = [18,25,35,60,100]

In [87]:
cats = pd.cut(ages,bins)

In [88]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [89]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [90]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [91]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [92]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [93]:
group_names = ['YOUTH','YOUNGADULT','MIDDLEAGED','SENIOR']

In [94]:
pd.cut(ages,bins,labels=group_names)

['YOUTH', 'YOUTH', 'YOUTH', 'YOUNGADULT', 'YOUTH', ..., 'YOUNGADULT', 'SENIOR', 'MIDDLEAGED', 'MIDDLEAGED', 'YOUNGADULT']
Length: 12
Categories (4, object): ['YOUTH' < 'YOUNGADULT' < 'MIDDLEAGED' < 'SENIOR']

In [95]:
data = np.random.rand(20)

In [96]:
pd.cut(data,4,precision = 2)

[(0.083, 0.31], (0.76, 0.99], (0.76, 0.99], (0.76, 0.99], (0.76, 0.99], ..., (0.54, 0.76], (0.31, 0.54], (0.54, 0.76], (0.54, 0.76], (0.31, 0.54]]
Length: 20
Categories (4, interval[float64, right]): [(0.083, 0.31] < (0.31, 0.54] < (0.54, 0.76] < (0.76, 0.99]]

In [97]:
data = np.random.randn(1000)

In [98]:
cats = pd.qcut(data,4)

In [99]:
cats

[(-3.7119999999999997, -0.63], (-0.63, 0.0408], (-3.7119999999999997, -0.63], (-0.63, 0.0408], (0.727, 3.158], ..., (-0.63, 0.0408], (-3.7119999999999997, -0.63], (-0.63, 0.0408], (0.727, 3.158], (-3.7119999999999997, -0.63]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.7119999999999997, -0.63] < (-0.63, 0.0408] < (0.0408, 0.727] < (0.727, 3.158]]

In [100]:
pd.value_counts(cats)

(-3.7119999999999997, -0.63]    250
(-0.63, 0.0408]                 250
(0.0408, 0.727]                 250
(0.727, 3.158]                  250
dtype: int64

In [102]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.275, 0.0408], (-1.275, 0.0408], (-3.7119999999999997, -1.275], (-1.275, 0.0408], (0.0408, 1.319], ..., (-1.275, 0.0408], (-1.275, 0.0408], (-1.275, 0.0408], (0.0408, 1.319], (-1.275, 0.0408]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.7119999999999997, -1.275] < (-1.275, 0.0408] < (0.0408, 1.319] < (1.319, 3.158]]

In [103]:
data = pd.DataFrame(np.random.randn(1000,4))

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001065     0.025326    -0.005847     0.012303
std       1.010268     1.017855     1.074812     0.987171
min      -3.323058    -2.819454    -4.102790    -3.059528
25%      -0.651265    -0.633875    -0.683186    -0.662107
50%       0.026222     0.017656     0.031101     0.000086
75%       0.641197     0.701543     0.684088     0.660009
max       3.560307     3.137883     3.034165     2.982179

In [105]:
col = data[2]

In [106]:
col[np.abs(col)>3]

154   -3.289463
328   -3.355364
660   -3.403133
669   -3.295017
722   -4.102790
733    3.030607
782    3.034165
965   -3.123844
Name: 2, dtype: float64

In [107]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
115  3.560307 -1.478638 -0.590560  0.325060
154  0.344072 -0.155072 -3.289463 -1.598930
328 -0.699859  0.050334 -3.355364  1.494666
453 -0.066469 -2.479415 -0.855890 -3.059528
493 -3.323058  1.119012 -0.343201 -0.286104
660 -0.874739  0.171908 -3.403133 -2.318322
669 -0.214871 -0.341253 -3.295017  1.699277
722  1.949213  0.822249 -4.102790 -0.300219
733  0.372854  1.964085  3.030607  0.467903
778 -3.317900  0.323100 -0.682786  0.058228
782  1.899852  1.452951  3.034165  1.142983
832  0.924941  3.137883  0.587196  0.671260
873  1.570519  3.004309  0.198199 -0.906748
965 -0.941765 -0.332960 -3.123844 -0.694243
979 -3.166364  1.598641  1.140471  0.370246

In [108]:
data[np.abs(data)>3] = np.sign(data) * 3

In [109]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000818     0.025184    -0.003342     0.012362
std       1.005922     1.017429     1.066642     0.986987
min      -3.000000    -2.819454    -3.000000    -3.000000
25%      -0.651265    -0.633875    -0.683186    -0.662107
50%       0.026222     0.017656     0.031101     0.000086
75%       0.641197     0.701543     0.684088     0.660009
max       3.000000     3.000000     3.000000     2.982179

In [110]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0 -1.0  1.0
3  1.0 -1.0  1.0  1.0
4  1.0 -1.0  1.0  1.0

In [112]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))

In [113]:
sampler = np.random.permutation(5)

In [114]:
sampler

array([2, 4, 1, 0, 3])

In [115]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [116]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [117]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [118]:
choices = pd.Series([5,7,-1,6,4])

In [119]:
draws = choices.sample(n = 10,replace=True)

In [120]:
draws

0    5
1    7
3    6
1    7
1    7
0    5
1    7
3    6
4    4
4    4
dtype: int64

In [121]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1': range(6)})

In [122]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [123]:
dummies = pd.get_dummies(df['key'],prefix = 'key')

In [124]:
df_with_dummy = df[['data1']].join(dummies)

In [125]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [126]:
mnames = ['movie_id','title','genres']

In [127]:
movies = pd.read_table('datasets/movielens/movies.dat',sep="::",
                      header=None,names=mnames)

/var/folders/3x/9l24p0_15v7f2c1jgn7mjslc0000gp/T/ipykernel_64627/2039979624.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat',sep="::",

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [128]:
np.random.seed(12345)

In [129]:
values = np.random.rand(10)

In [130]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [131]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [133]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [134]:
val = 'a,b, guido'

In [135]:
val.split(',')

['a', 'b', ' guido']

In [136]:
pieces = [x.strip() for x in val.split(',')]

In [137]:
pieces

['a', 'b', 'guido']

In [138]:
first,second,third = pieces

In [139]:
first + '::'+ second + '::'+ third

'a::b::guido'

In [140]:
':'.join(pieces)

'a:b:guido'

In [141]:
'guido' in val

True

In [142]:
val.index(",")

1

In [143]:
val.find(':')

-1

In [144]:
val.index(':')

ValueError: substring not found

In [145]:
val.count(",")

2

In [146]:
val.replace(',','::')

'a::b:: guido'

In [148]:
val.replace(',','')

'ab guido'

In [149]:
import re

In [150]:
text = "foo bar\t baz \tqux"

In [151]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex.findall(text)

NameError: name 'regex' is not defined

In [153]:
regex = re.compile('\s+')

In [154]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [155]:
regex.findall(text)

[' ', '\t ', ' \t']

In [156]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [168]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [169]:
regex = re.compile(pattern,flags = re.IGNORECASE)

In [171]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [172]:
m = regex.search(text)

In [173]:
m

In [174]:
text[m.start():m.end()]

'dave@google.com'

In [175]:
print(regex.match(text))

None

In [176]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [177]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [178]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [179]:
m = regex.match('wesm@bright.net')

In [180]:
m.groups()

('wesm', 'bright', 'net')

In [181]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [182]:
print(regex.sub(r'Username: \1,Domain: \2,Suffix: \3',text))

Dave Username: dave,Domain: google,Suffix: com
Steve Username: steve,Domain: gmail,Suffix: com
Rob Username: rob,Domain: gmail,Suffix: com
Ryan Username: ryan,Domain: yahoo,Suffix: com

In [183]:
data = {'Dave':'dave@google.com','Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com','Wes': np.nan}

In [189]:
data = pd.Series(data)

In [190]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [191]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [192]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [193]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [194]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [196]:
matches = data.str.match(pattern,flags=re.IGNORECASE)

In [197]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [198]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [199]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [200]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object